# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [3]:
# 記得先 Import 正確的套件

import numpy as np
import pandas as pd
# 檢查正確載入與版本
print(np)
print(np.__version__)
print(pd)
print(pd.__version__)

<module 'numpy' from 'D:\\Anaconda3\\lib\\site-packages\\numpy\\__init__.py'>
1.20.1
<module 'pandas' from 'C:\\Users\\User\\AppData\\Roaming\\Python\\Python38\\site-packages\\pandas\\__init__.py'>
1.2.3

In [22]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [23]:
df.groupby('animal').age.mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [24]:
print(df.sort_values(by=['age', 'visits'], ascending=[True, False]))

# 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
df["priority"]=df["priority"].replace(["yes","no"],[True,False])
print(df)

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes
  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [49]:
df1 = pd.DataFrame(np.random.random(size=(5, 3)))
df1

          0         1         2
0  0.074093  0.765127  0.102020
1  0.072279  0.071740  0.677239
2  0.193663  0.059760  0.272633
3  0.636012  0.022099  0.306713
4  0.288297  0.976226  0.867654

In [50]:
print(df1 - df1.mean())

          0         1         2
0 -0.178776  0.386137 -0.343232
1 -0.180590 -0.307250  0.231988
2 -0.059206 -0.319231 -0.172619
3  0.383143 -0.356891 -0.138539
4  0.035429  0.597235  0.422403

In [54]:
# print(df1.mean(axis=1))
# print(0.074093-0.313747)
df1.sub(df1.mean(axis=1), axis=0)

0    0.313747
1    0.273753
2    0.175352
3    0.321608
4    0.710726
dtype: float64
-0.23965399999999998

          0         1         2
0 -0.239654  0.451380 -0.211726
1 -0.201474 -0.202012  0.403487
2  0.018311 -0.115592  0.097281
3  0.314404 -0.299509 -0.014895
4 -0.422428  0.265500  0.156929

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [55]:
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

In [56]:
# 哪一筆的資料總合最小
df1.sum().idxmin()

0

In [57]:
df1.sum(axis=1).idxmin()

2